Revit.Properties.Resources
A strongly-typed resource class, for looking up localized strings, etc.

Revit.Properties.Resources.ResourceManager
Returns the cached ResourceManager instance used by this class.

Revit.Properties.Resources.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Revit.Properties.Resources.Adaptive_Component_Creation_Failed
Looks up a localized string similar to An adaptive component could not be found or created..

Revit.Properties.Resources.AnalysisResultsDefaultDescription
Looks up a localized string similar to Analysis Results from Dynamo.

Revit.Properties.Resources.AnalysisResultsDefaultName
Looks up a localized string similar to Dynamo Analysis Results.

Revit.Properties.Resources.Array_Count_Mismatch
Looks up a localized string similar to The number of sample locations and samples is not equal..

Revit.Properties.Resources.CellForPanelNotFound
Looks up a localized string similar to Could not find cell for panel.

Revit.Properties.Resources.CurtainGridNotFound
Looks up a localized string similar to Element has no Curtain Grid..

Revit.Properties.Resources.CurtainGridReferenceError
Looks up a localized string similar to Reference should be to Face of the Element..

Revit.Properties.Resources.CurtainPanelInternalElementError
Looks up a localized string similar to InternalElement of Curtain Panel is not Panel..

Revit.Properties.Resources.CurtainPanelIsNotPlanar
Looks up a localized string similar to Curtain Panel is not planar.

Revit.Properties.Resources.CurtainPanelIsNotRectangular
Looks up a localized string similar to Curtain Panel is not rectangular.

Revit.Properties.Resources.CurtainPanelShouldRepresentRevitPanel
Looks up a localized string similar to Curtain Panel should represent Revit panel.

Revit.Properties.Resources.CurveNeedsTwoPoints
Looks up a localized string similar to Cannot create Curve By Points with less than two points..

Revit.Properties.Resources.CurveReferenceExtractionDetail
Looks up a localized string similar to You supplied an {0}, but we could not extract a CurveReference from it!.

Revit.Properties.Resources.CurveReferenceExtractionFailure
Looks up a localized string similar to {0} requires a ElementCurveReference extracted from a Revit Element! .

Revit.Properties.Resources.CurveReferenceFailure
Looks up a localized string similar to A Curve Reference can only be obtained from an Element..

Revit.Properties.Resources.CurveReferenceHint
Looks up a localized string similar to You can use the {0} or {1} to turn this Curve into a Revit Element..

Revit.Properties.Resources.Dynamo_AVF_Data_Name
Looks up a localized string similar to Dynamo Data.

Revit.Properties.Resources.FaceReferenceExtractionDetail
Looks up a localized string similar to You supplied an {0}, but we could not extract a ElementFaceReference from it!.

Revit.Properties.Resources.FaceReferenceExtractionFailure
Looks up a localized string similar to {0} requires a ElementFaceReference extracted from a Revit Element! .

Revit.Properties.Resources.FaceReferenceFailure
Looks up a localized string similar to A Face Reference can only be obtained from an Element..

Revit.Properties.Resources.FaceReferenceHint
Looks up a localized string similar to You can use the {0} to turn this Surface into a Revit Element, then extract a ElementFaceReference from it..

Revit.Properties.Resources.FamilyInstanceCreationFailure
Looks up a localized string similar to Could not create the FamilyInstance.

Revit.Properties.Resources.FamilyNotFound
Looks up a localized string similar to A family with the specified name, {0}, could not be found in the document..

Revit.Properties.Resources.FamilySymbolNotFound1
Looks up a localized string similar to A FamilySymbol with the specified name does not exist in the document..

Revit.Properties.Resources.FamilySymbolNotFound2
Looks up a localized string similar to A FamilySymbol with the specified name, {0}, does not exist in the Family..

Revit.Properties.Resources.FamilySymbolNotFound3
Looks up a localized string similar to A FamilySymbol with the specified name, {0}, does not exist in the document..

Revit.Properties.Resources.FileNotFound
Looks up a localized string similar to The file could not be found at: {0}.

Revit.Properties.Resources.FloorTypeNotFound
Looks up a localized string similar to A Revit FloorType with that name could not be located in the document..

Revit.Properties.Resources.GeometryObjectReferenceFailure
Looks up a localized string similar to Could not get a geometry object from the current document using the provided reference.

Revit.Properties.Resources.GridCreationFailure
Looks up a localized string similar to A Grid Element can only be created in a Revit Project..

Revit.Properties.Resources.InputParamsMismatch
Looks up a localized string similar to The input list of parameters does not have the same number of values required by the adaptive component..

Revit.Properties.Resources.InputPointParamsMismatch
Looks up a localized string similar to The input list of points does not have the same number of values required by the adaptive component..

Revit.Properties.Resources.InputUVParamsMismatch
Looks up a localized string similar to The input list of UVs does not have the same number of values required by the adaptive component..

Revit.Properties.Resources.InstanceImportFailure
Looks up a localized string similar to Could not obtain ImportInstance from imported Element.

Revit.Properties.Resources.InvalidCategory
Looks up a localized string similar to The selected category is not valid in this document..

Revit.Properties.Resources.InvalidColumnBaseLocation
Looks up a localized string similar to The end of the curve for creating a column should be above the start of the curve..

Revit.Properties.Resources.InvalidElementLocation
Looks up a localized string similar to The location of the structural element is not a valid curve..

Revit.Properties.Resources.InvalidWallHeight
Looks up a localized string similar to The height must be greater than 0 and less that 30000 ft.  You provided a height of {0} ft..

Revit.Properties.Resources.MaterialNotFound
Looks up a localized string similar to A Material with the given name does not exist in the current Document..

Revit.Properties.Resources.ModelTextCreationFailure
Looks up a localized string similar to ModelText Elements can only be created in a Family Document..

Revit.Properties.Resources.ModelTextTypeNotFound
Looks up a localized string similar to There is no ModelTextType of the name, {0}, in the current Document..

Revit.Properties.Resources.MullionParseError
Looks up a localized string similar to Mullion should represent Revit's Mullion..

Revit.Properties.Resources.NotAdaptiveComponentError
Looks up a localized string similar to The FamilyInstance is not an adaptive component..

Revit.Properties.Resources.NotPositiveIntegerError
Looks up a localized string similar to {0} must be a positive integer.

Revit.Properties.Resources.NullInputCurvesError
Looks up a localized string similar to Some of the input curves are null..

Revit.Properties.Resources.NumberOfDivisionsMustBeGreaterThan2
Looks up a localized string similar to The number of divisions must be greater than 2!.

Revit.Properties.Resources.OpenInputPolyCurveError
Looks up a localized string similar to The input PolyCurve is not closed..

Revit.Properties.Resources.ParameterNotFound
Looks up a localized string similar to No parameter found by that name..

Revit.Properties.Resources.ParameterStorageNotElement
Looks up a localized string similar to The parameter's storage type is not an Element..

Revit.Properties.Resources.ParameterStorageNotInteger
Looks up a localized string similar to The parameter's storage type is not an integer..

Revit.Properties.Resources.ParameterStorageNotNumber
Looks up a localized string similar to The parameter's storage type is not a number..

Revit.Properties.Resources.ParameterStorageNotString
Looks up a localized string similar to The parameter's storage type is not a string..

Revit.Properties.Resources.ParameterWithoutStorageType
Looks up a localized string similar to Parameter {0} has no storage type..

Revit.Properties.Resources.PolyCurvesConversionError
Looks up a localized string similar to Revit does not support turning PolyCurves into ModelCurves. Try exploding your PolyCurve into multiple Curves..

Revit.Properties.Resources.ReferenceCurveCreationFailure
Looks up a localized string similar to Revit can only create a ReferenceCurve in a Family Document..

Revit.Properties.Resources.ReferencePointCreationFailure
Looks up a localized string similar to ReferencePoint Elements can only be created in a Family Document..

Revit.Properties.Resources.SamplePointsMismatchError
Looks up a localized string similar to The number of sample points and number of samples must be the same..

Revit.Properties.Resources.Tag_Lookup_Error
Looks up a localized string similar to A Revit face with the corresponding tag could not be found..

Revit.Properties.Resources.TopographyNeedsThreePoints
Looks up a localized string similar to A minimum of three points is required to create a topography surface..

Revit.Properties.Resources.UnitTypeConversionError
Looks up a localized string similar to ParameterType cannot be converted to UnitType..

Revit.Properties.Resources.View_ExportAsImage_Path_Invalid
Looks up a localized string similar to The supplied path is invalid..

Revit.Properties.Resources.WallTypeNotFound
Looks up a localized string similar to There is no WallType of the given name in the current Document..